app/views/users/show.html.erb

      <h3>Movies</h3>
      <% @user.watch_items.each do |watch_item| %>
      <% title_id =  watch_item.title_id  %>
      <% title = Title.find title_id %>
---
SELECT "watch_items".* FROM "watch_items" WHERE "watch_items"."user_id" = 1
SELECT "titles".* FROM "titles" WHERE "titles"."id" = $1 LIMIT 1  [["id", 1]]