app/controllers/reviews_controller.rb

SELECT "titles".* FROM "titles" WHERE "titles"."id" = $1 LIMIT 1  [["id", "2"]]
INSERT INTO "reviews" ("body", "created_at", "title_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "first!"], ["created_at", Thu, 24 Oct 2013 05:02:48 UTC +00:00], ["title_id", 2], ["updated_at", Thu, 24 Oct 2013 05:02:48 UTC +00:00], ["user_id", nil]]
---
  def create
    @title = Title.find(params[:title_id])
    # comment = params[:comment]
    # @article.comments << comment
    @review = @title.reviews.new(params[:review])

    if @review.save