app/controllers/titles_controller.rb

SELECT "titles".* FROM "titles" WHERE "titles"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def show
    @title = Title.find(params[:id])