app/controllers/watch_items_controller.rb

SELECT "titles".* FROM "titles" WHERE "titles"."imdbID" = 'tt0372784' LIMIT 1
INSERT INTO "titles" ("created_at", "imdbID", "plot", "poster", "title", "type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "watch_items".* FROM "watch_items" WHERE "watch_items"."user_id" = 1
SELECT "titles".* FROM "titles" WHERE "titles"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "watch_items" ("created_at", "title_id", "updated_at", "user_id", "watched") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 23 Oct 2013 17:22:42 UTC +00:00], ["title_id", 0], ["updated_at", Wed, 23 Oct 2013 17:22:42 UTC +00:00], ["user_id", 1], ["watched", false]]
UPDATE "watch_items" SET "title_id" = 1, "updated_at" = '2013-10-23 18:58:56.488605' WHERE "watch_items"."id" = 6
---
  def create
    current_title = Title.where(:imdbID => params[:imdb_id]).first
    if current_title.nil?
      movie_hash = OMDB.title(params[:title])
      title = movie_hash[:title]
      kind = movie_hash[:type]
      poster = movie_hash[:poster]
      plot = movie_hash[:plot]
      imdb_id = movie_hash[:imdb_id]
      new_title = Title.new
      new_title.title = title
      new_title.kind = kind
      new_title.poster = poster
      new_title.plot = plot
      new_title.imdbID = imdb_id
      new_title.save

      watched_title = Title.where(:imdbID => new_title.imdbID).first
    else
      watched_title = Title.where(:imdbID => current_title.imdbID).first
    end

    watch_list = []
    current_user.watch_items.each do |item|
      movie_id = item.title_id
      item = Title.find movie_id
      watch_list << item.imdbID
    end

    unless watch_list.include? watched_title.imdbID
      watch_item = current_user.watch_items.create
      watch_item.title_id = watched_title.id
      watch_item.save

SELECT "watch_items".* FROM "watch_items" WHERE "watch_items"."user_id" = 1 AND "watch_items"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "watch_items" SET "watched" = 't', "updated_at" = '2013-10-24 00:06:33.767775' WHERE "watch_items"."id" = 1
---
  def update
    @watch_item = current_user.watch_items.find(params[:id])
    @watch_item.watched = true
    @watch_item.save

SELECT "watch_items".* FROM "watch_items" WHERE "watch_items"."user_id" = 1 AND "watch_items"."id" = $1 LIMIT 1  [["id", "3"]]
DELETE FROM "watch_items" WHERE "watch_items"."id" = $1  [["id", 3]]
---
  def destroy
    @watch_item = current_user.watch_items.find(params[:id])
    @watch_item.destroy